app/helpers/posts_helper.rb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["post_id", 2], ["user_id", 6], ["LIMIT", 1]]
---
  def find_user_post(post)
    post.likes.find_by(user_id: current_user.id)