app/helpers/users_helper.rb

  def find_friendship_by_friend(friend)
    @friendship = Friendship.find_by(user_id: current_user.id, friend_id: friend.id)

    if @friendship.nil?
      return Friendship.find_by(user_id: friend.id, friend_id: current_user.id)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]