app/views/posts/index.html.erb

      <span>
        By: <%= post.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]