app/views/posts/show.html.erb

        <span>
          <%= @post.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

          <div class="likes">
            <%= pluralize(@post.likes.count, 'Like') %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["post_id", 8], ["id", 8], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]

          <div class="comments">
            <%= pluralize(@post.comments.count, 'Comment') %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]

        <ul class="comments-container">
          <% @post.comments.right_order.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 6]]

              <span>
                <%= comment.commenter.first_name %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 6]]