app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments << current_user.comments.build(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 2], ["content", "sdfdsfsf"], ["created_at", "2020-01-24 20:01:32.629542"], ["updated_at", "2020-01-24 20:01:32.629542"], ["user_id", 6]]