app/controllers/friendships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["friend_id", 2], ["created_at", "2020-01-23 20:39:28.954680"], ["updated_at", "2020-01-23 20:39:28.954680"]]
---
  def create
    @friend = User.find(frienship_params[:friend_id])
    @user = current_user
    @friendship = @user.friendships.build(friend_id: @friend.id)
    @inverse_friendship = @friend.inverse_friendships.build(user_id: @user.id)
    if @friend == @user
      flash[:error] = 'you cannot send a friend request to yourself'
    elsif @friendship.save && @inverse_friendship

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @friendship = Friendship.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."user_id" = $2 LIMIT $3  [["friend_id", 2], ["user_id", 1], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 LIMIT $3  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
UPDATE "friendships" SET "status" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["status", true], ["updated_at", "2020-01-23 20:40:10.950172"], ["id", 33]]
UPDATE "friendships" SET "status" = $1, "updated_at" = $2 WHERE "friendships"."id" = $3  [["status", true], ["updated_at", "2020-01-23 20:40:10.986885"], ["id", 33]]
---
  def update
    @friend = User.find(params[:id])
    @friendship = current_user.inverse_friendships.find_by(user_id: @friend.id)
    @inverse_friendship = @friend.friendships.find_by(friend_id: current_user.id)

    @friendship.update(status: true)
    @inverse_friendship.update(status: true)

    if @friendship.save && @inverse_friendship
      flash[:success] = "#{@friend.first_name} and you are friends!"

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 36]]
---
  def destroy
    @friendship = Friendship.find(params[:id])
    @friendship.delete

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."user_id" = $2 AND "friendships"."friend_id" = $3 LIMIT $4  [["friend_id", 5], ["user_id", 1], ["friend_id", 5], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."user_id" = $2 AND "friendships"."friend_id" = $3 LIMIT $4  [["user_id", 1], ["user_id", 1], ["friend_id", 5], ["LIMIT", 1]]
---
  def friendship_exists
    @friend = User.find(frienship_params[:friend_id])
    @user = current_user

    @friendship = current_user.inverse_friendships.find_by(user_id: @friend.id, friend_id: current_user.id)
    @inverse_friendship = @friend.friendships.find_by(user_id: @friend.id, friend_id: current_user.id)