app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["post_id", 2], ["created_at", "2020-01-24 20:01:26.296577"], ["updated_at", "2020-01-24 20:01:26.296577"]]
---
  def create
    @post = Post.find_by(id: params[:post_id])
    @like = @post.likes << current_user.likes.build

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    @like.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1 AND "likes"."id" = $2 LIMIT $3  [["post_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def find_like
    @post = Post.find_by(id: params[:post_id])
    @like = @post.likes.find(params[:id])