app/controllers/posts_controller.rb

  def create
    @user = User.find_by(id: current_user.id)
    @post = @user.posts.build(post_params)

    if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "dfsdfsdfsadf"], ["user_id", 2], ["created_at", "2020-01-16 21:18:13.485677"], ["updated_at", "2020-01-16 21:18:13.485677"]]