app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def friends
    friends = friendships.map { |friendship| friendship.friend if friendship.status }
    friends += inverse_friendships.map { |friendship| friendship.user if friendship.status }

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def friendship_request
    inverse_friendships.map { |friendship| friendship.user unless friendship.status }.compact

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mieguelguerra123456@gmail.com"], ["LIMIT", 1]]
---
  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?

INSERT INTO "users" ("email", "encrypted_password", "first_name", "last_name", "user_img", "created_at", "updated_at", "provider", "uid") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "facebook"], ["uid", "167415791244945"], ["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
      user.email = auth.info.email
      user.password = Devise.friendly_token[0,20]
      user.first_name = auth.info.name.split(' ')[0]